import sqlite3
from security import PasswordManager
from datetime import datetime, timedelta
import json


def populate_database():
    conn = sqlite3.connect('student_bot.db')
    cur = conn.cursor()
    pw_manager = PasswordManager()

    # Группы
    groups = [
        (1, '21ВВС1'), (2, '21ВА1'), (3, '22ВВС1'), 
        (4, '22ВА1'), (5, '23ВВВ4'), (6, '23ВА1'), 
        (7, '24ВВВ4'), (8, '24ВА1')
    ]
    for group in groups:
        cur.execute("INSERT OR IGNORE INTO groups (id, name_group) VALUES (?, ?)", group)

    # Студенты
    with open("students.json", "r", encoding='utf-8') as f:
        students_data = json.load(f)

    for group_id, students in students_data.items():
        for student in students:
            id_student = student["id"]
            login = student["login"]
            password = student["password"]
            description = student["name"]
            cur.execute(
                "INSERT OR IGNORE INTO students (id_student, id_group, login, password, description) VALUES (?, ?, ?, ?, ?)",
                (id_student, group_id, login, pw_manager.encrypt(password), description)
            )


 # Добавляем преподавателей
    teachers = ['Бурукина И.П.', 'Бершадский А.М.', 'Бождай А.С.', 
                'Финогеев А.Г.', 'Подмарькова Е.М.', 'Тимонин А.Ю.', 
                'Селиверстова И.А.', 'Глотова Т.В.', 'Валько А.Ф.', 
                'Евсеева Ю.И.', 'Гудков А.А.', 'Гудков П.А.', 
                'Финогеев А.А.', 'Эпп В.В.','Мурысина Н.Н.',
                'Яшин С.В.','Болотникова О.В.','Калиниченко Е.И.',
                'Митрохина Н.Ю', 'Юрова О.В.', 'Гарбуз Г.В.', 
                'Слепцов Н.В.','Генералова А.А.','Голотенков Н.О.',
                'Токарев А.Н.','Сеидов Ш.Г.','Кучигина С.К.',
                'Тимошина С.А.','Данкова Н.С.','Самуйлова С.В.',
                'Мусорина О.А.','Романова Е.Г','Акифьев И.В.',
                'Дубинин В.Н.','Логинова О.А.','Митишев А.В.',
                'Авдонина Л.А.', 'Синев М.П.', 'Исхаков Н.В.',
                'Бычков А.С.', 'Семенов А.О.', 'Леонова Т.Ю.',
                'Мишина К.Д.', 'Бикташев Р.А.', 'Ермохина Е.Н.',
                'Никишин К.И.', 'Кузьмин А.В.', 'Масленников А.А.',
                'Кузнецова О.Ю.','Елистратова О.В'
                ]
    for teacher in teachers:
        cur.execute("INSERT OR IGNORE INTO teachers (full_name) VALUES (?)", (teacher,))

  # Заполнение типов задолженностей
    debt_types = ['Экзамен', 'Зачет', 'Зачет с оценкой', 'Курсовая работа']
    for debt_type in debt_types:
        cur.execute('INSERT INTO debt_types (name) VALUES (?)', (debt_type,))

    # Заполнение предметов
    subjects = [ 'Кураторский час','Физика','Математика','Арифметические и логические основы ВТ',
                'Информационные технологии в проф. деятельности','История России','Элективные дисциплины по физической культуре и спорту',
                'Программирование','Правоведение','Вычислительные и ИС','Русский язык и деловые коммуникации','Ин.яз',
                'Математический анализ','Информатика','Алгебра и теория чисел','Геометрия и топология','Инсталляция и эксплуатация ВСиС',
                'Декларативные языки прогр.','ООП','ОиСП','ДВ Основы первой доврачебной помощи','ДВ Основы военной подготовки',
                'Интерфейсы программирования приложений','Компьютерная графика и 3D моделирование','Электротехника, электроника и схемотехника',
                'Теория автоматов','Дисциплина по выбору','МО ИС','Математическое обеспечение информационных систем',
                'ДВ Лингвистическое и программное обеспечение','Вычислительные методы в системах администрирования','Компьютерная графика',
                'Структуры и алгоритмы компьютерной обработки данных','Администрирование инфокоммуникационных систем','Автоматизация конструкторского проектирования ЭА',
                'Компьютерное моделирование в системах АП','ЭВМ и периферийные устройства','Технологии разработки программного обеспечения',
                'Экономико-правовые основы рынка программного обеспечения','Качество и тестирование программного обеспечения', 
                'Мультимедийные технологии', 'Интеллектуализация информационных систем','Проектирование ИС c использованием ШП',
                'Операционные системы и оболочки', 'Информационные технологии','Модели и методы анализа ПР','Геометрическое моделирование в системах АП',
                'Системы реального времени','Архитектура компьютерных систем','Администрирование информационных систем',
                ]
    for subject in subjects:
        cur.execute('INSERT INTO subjects (name) VALUES (?)', (subject,))



    # Заполнение таблицы disciplines (дисциплины)
    disciplines_data = [
        (48, 1),  # Системы реального времени Бурукина И.П.
        (36, 1),  # Компьютерное моделирование в системах АП Бурукина И.П.
        (35, 2),  # Автоматизация конструкторского проектирования ЭА Бершадский А.М.
        (32, 3),  # Компьютерная графика Бождай А.С.
        (45, 3),  # Информационные технологии Бождай А.С.
        (34, 4),  # Администрирование инфокоммуникационных систем Финогеев А.Г.
        (50, 4),  # Администрирование информационных систем Финогеев А.Г.
        (30, 4),  # ДВ Лингвистическое и программное обеспечение Финогеев А.Г.
        (41, 4),  # Мультимедийные технологии Финогеев А.Г.
        (49, 4),  # Архитектура компьютерных систем Финогеев А.Г.
        (24, 4),  # Компьютерная графика и 3D моделирование Финогеев А.Г.
        (19, 5),  # ООП Подмарькова Е.М.
        (36, 6),  # Компьютерное моделирование в системах АП Тимонин А.Ю.
        (14, 6),  # Информатика Тимонин А.Ю.
        (45, 6),  # Информационные технологии Тимонин А.Ю.
        (10, 6),  # Вычислительные и ИС Тимонин А.Ю.
        (39, 7),  # Экономико-правовые основы рынка программного обеспечения Селиверстова И.A.
        (33, 8),  # Структуры и алгоритмы компьютерной обработки данных Глотова Т.В.
        (14, 8),  # Информатика Глотова Т.В.
        (43, 8),  # Проектирование ИС c использованием ШП Глотова Т.В.
        (28, 9),  # МО ИС Валько А.Ф.
        (46, 9),  # Модели и методы анализа ПР Валько А.Ф.
        (29, 9),  # Математическое обеспечение информационных систем  Валько А.Ф.
        (38, 9),  # Технологии разработки программного обеспечения Валько А.Ф.
        (10, 9),  # Вычислительные и ИС Валько А.Ф.
        (44, 10), # Операционные системы и оболочки Евсеева Ю.И.
        (19, 10), # ООП Евсеева Ю.И.
        (33, 10), # Структуры и алгоритмы компьютерной обработки данных Евсеева Ю.И.
        (43, 10), # Проектирование ИС c использованием ШП Евсеева Ю.И.
        (8, 10),  # Программирование Евсеева Ю.И.
        (19, 11), # ООП Гудков А.А.
        (47, 11), # Геометрическое моделирование в системах АП Гудков А.А.
        (8, 11),  # Программирование АП Гудков А.А.
        (31, 11), # Вычислительные методы в системах администрирования АП Гудков А.А.
        (44, 11), # Операционные системы и оболочки Гудков А.А.
        (35, 12), # Автоматизация конструкторского проектирования ЭА Гудков П.А.
        (31, 12), # Вычислительные методы в системах администрирования АП Гудков П.А.
        (49, 12), # Архитектура компьютерных систем Гудков П.А.
        (40, 12), # Качество и тестирование программного обеспечения Гудков П.А.
        (39, 12), # Экономико-правовые основы рынка программного обеспечения Гудков П.А.
        (48, 12), # Системы реального времени Гудков П.А.
        (30, 13), # ДВ Лингвистическое и программное обеспечение Финогеев А.А.
        (24, 13), # Компьютерная графика и 3D моделирование Финогеев А.А.
        (50, 13), # Администрирование информационных систем Финогеев А.А.
        (41, 13), # Мультимедийные технологии Финогеев А.А.
        (32, 13), # Компьютерная графика Финогеев А.А.
        (34, 13), # Администрирование инфокоммуникационных систем Финогеев А.А.
        (29, 14), # Математическое обеспечение информационных систем Эпп В.В.
        (40, 14), # Качество и тестирование программного обеспечения Эпп В.В.
        (38, 14), # Технологии разработки программного обеспечения Эпп В.В.
        (28, 14), # МО ИС Эпп В.В.
        (2, 15),  # Физика Мурысина Н.Н.
        (2, 16),  # Физика Яшин С.В.
        (3, 17),  # Математика Болотникова О.В.
        (4, 18),  # Арифметические и логические основы ВТ Калиниченко Е.И.
        (5, 19),  # Информационные технологии в проф. деятельности Митрохина Н.Ю
        (5, 20),  # Информационные технологии в проф. деятельности Юрова О.В.
        (6, 21),  # История России Гарбуз Г.В.
        (4, 22),  # Арифметические и логические основы ВТ Слепцов Н.В.
        (37, 22), # ЭВМ и периферийные устройства Слепцов Н.В.
        (8, 23),  # Программирование Генералова А.А.
        (8, 24),  # Программирование Голотенков Н.О.
        (8, 25),  # Программирование Токарев А.Н.
        (9, 26),  # Правоведение Сеидов Ш.Г.
        (11, 27), # Русский язык и деловые коммуникации Кучигина С.К.
        (12, 28), # Ин.яз Тимошина С.А.
        (12, 29), # Ин.яз Данкова Н.С.
        (13, 30), # Математический анализ Самуйлова С.В.
        (12, 31), # Ин.яз Мусорина О.А.
        (15, 32), # Алгебра и теория чисел Романова Е.Г
        (16, 32), # Геометрия и топология Романова Е.Г
        (17, 33), # Инсталляция и эксплуатация ВСиС Акифьев И.В.
        (18, 33), # Декларативные языки прогр. Акифьев И.В.
        (18, 34), # Декларативные языки прогр. Дубинин В.Н.
        (20, 35), # ОиСП Логинова О.А.
        (21, 36), # ДВ Основы первой доврачебной помощи Митишев А.В.
        (22, 37), # ДВ Основы военной подготовки Авдонина Л.А.
        (23, 38), # Интерфейсы программирования приложений Синев М.П.
        (23, 39), # Интерфейсы программирования приложений Исхаков Н.В.
        (25, 40), # Электротехника, электроника и схемотехника Бычков А.С.
        (25, 41), # Электротехника, электроника и схемотехника Семенов А.О.
        (26, 41), # Теория автоматов Семенов А.О.
        (17, 42), # Инсталляция и эксплуатация ВСиС Леонова Т.Ю.
        (22, 43), # ДВ Основы военной подготовки Мишина К.Д.
        (26, 44), # Теория автоматов Бикташев Р.А.
        (21, 45), # ДВ Основы первой доврачебной помощи Ермохина Е.Н.
        (37, 46), # ЭВМ и периферийные устройства Никишин К.И.
        (42, 47), # Интеллектуализация информационных систем Кузьмин А.В.
        (42, 48), # Интеллектуализация информационных систем Масленников А.А.
        (42, 49), # Интеллектуализация информационных систем Кузнецова О.Ю.
        (9, 50)  # Правоведение Елистратова О.В
    ]
    for discipline in disciplines_data:
        cur.execute('''
            INSERT OR IGNORE INTO disciplines (subject_id, teacher_id)
            VALUES (?, ?)
        ''', discipline)

   
    # Заполнение новостей
    news_data = [
        ('Отмена занятий', 'В связи с отключением электричества занятия отменены с 11:40', 
         (datetime.now() + timedelta(days=1)).strftime('%Y-%m-%d'), '7к', 0, 1),
        ('Собрание старост', 'Собрание старост в 15:00', 
         datetime.now().strftime('%Y-%m-%d'), '7а-203', 0, 1),
         ('Собрание группы', 'Собрание группы по поводу практики ', 
         datetime.now().strftime('%Y-%m-%d'), '7а-203', 1, 1),
    ]
    for news in news_data:
        cur.execute('''
            INSERT INTO news (title, description, date, place, for_all_groups, is_published)
            VALUES (?, ?, ?, ?, ?, ?)
        ''', news)

    # Связи новостей и групп (для новостей не для всех)
    news_groups = [(3, 1)]  # Собрание старост только для 21ВВС1 и 21ВА1
    for ng in news_groups:
        cur.execute('INSERT INTO news_groups (news_id, group_id) VALUES (?, ?)', ng)
    
        # Заполнение тестов
    tests_data = [
        (1, 5, 'https://test.com', (datetime.now() + timedelta(days=5)).strftime('%Y-%m-%d')),
        (2, 1, 'https://test.com', (datetime.now() + timedelta(days=7)).strftime('%Y-%m-%d')),

    ]
    for test in tests_data:
        cur.execute('''
            INSERT INTO tests (group_id, discipline_id, test_link, date)
            VALUES (?, ?, ?, ?)
        ''', test)

        # Задолженности студентов
    student_debts_data = [
        (2, 48, 1, (datetime.now() + timedelta(days=14)).strftime('%Y-%m-%d')),  
        (2, 48, 2, (datetime.now() + timedelta(days=21)).strftime('%Y-%m-%d')),  
        (3, 24, 4, (datetime.now() + timedelta(days=7)).strftime('%Y-%m-%d')),   
        (4, 50, 3, (datetime.now() + timedelta(days=10)).strftime('%Y-%m-%d'))   
    ]
    for debt in student_debts_data:
        cur.execute('''
            INSERT INTO student_debts (student_id, discipline_id, debt_type_id, last_date)
            VALUES (?, ?, ?, ?)
        ''', debt)


    conn.commit()
    conn.close()

if __name__ == "__main__":
    populate_database()  # Теперь скрипт нужно запускать вручную